pmo-dataset/variations/graphviz_with_ids/04.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "Task_1" [label="Create content"];
  "Task_2" [label="Sales teams follows\nup on leads"];
  "Task_3" [label="Track performance in\nreal-time"];
  "Task_4" [label="Collect leads in CRM\nsystem"];
  "Task_5" [label="Select promotion\nchannels"];
  "Task_6" [label="Analyze performance\nfor future\noptimization"];
  "Task_7" [label="Launch campaign"];
  "Task_8" [label="Define campaign\nobjectives"];
  "Task_9" [label="Campaign period ends"];
  "Task_10" [label="Design visuals"];
  "StartNoneEvent_1" [shape=circle, label="start"];
  "EndNoneEvent_1" [shape=circle, penwidth=4, label="end"];
  "ExclusiveGateway_1" [shape=diamond, label="X"];
  "ExclusiveGateway_2" [shape=diamond, label="X"];
  "ParallelGateway_1" [shape=diamond, label="+"];
  "ParallelGateway_2" [shape=diamond, label="+"];
  "ParallelGateway_3" [shape=diamond, label="+"];
  "ParallelGateway_4" [shape=diamond, label="+"];
  "ParallelGateway_5" [shape=diamond, label="+"];
  "ParallelGateway_6" [shape=diamond, label="+"];

  "ParallelGateway_5" -> "Task_6";
  "ParallelGateway_3" -> "Task_5";
  "ParallelGateway_5" -> "ParallelGateway_4";
  "ParallelGateway_6" -> "Task_4";
  "ExclusiveGateway_1" -> "ParallelGateway_4";
  "Task_3" -> "ParallelGateway_5";
  "ParallelGateway_3" -> "Task_10";
  "Task_8" -> "ParallelGateway_3";
  "ExclusiveGateway_2" -> "ExclusiveGateway_1";
  "Task_9" -> "ParallelGateway_2";
  "Task_5" -> "ParallelGateway_1";
  "ExclusiveGateway_2" -> "Task_2";
  "Task_6" -> "ParallelGateway_2";
  "Task_4" -> "ExclusiveGateway_2";
  "Task_10" -> "ParallelGateway_1";
  "ParallelGateway_1" -> "Task_7";
  "Task_7" -> "ParallelGateway_6";
  "ParallelGateway_2" -> "EndNoneEvent_1";
  "ParallelGateway_4" -> "Task_9";
  "ParallelGateway_6" -> "Task_3";
  "StartNoneEvent_1" -> "Task_8";
  "Task_2" -> "ExclusiveGateway_1";
  "Task_1" -> "ParallelGateway_1";
  "ParallelGateway_3" -> "Task_1";
}
