pmo-dataset/variations/mermaid_basic/04.mmd
graph LR
	ParallelGateway_5{"+"} --> Task_6["Analyze performance for future optimization"]
	ParallelGateway_3{"+"} --> Task_5["Select promotion channels"]
	ParallelGateway_5 --> ParallelGateway_4{"+"}
	ParallelGateway_6{"+"} --> Task_4["Collect leads in CRM system"]
	ExclusiveGateway_1{"X"} --> ParallelGateway_4
	Task_3["Track performance in real-time"] --> ParallelGateway_5
	ParallelGateway_3 --> Task_10["Design visuals"]
	Task_8["Define campaign objectives"] --> ParallelGateway_3
	ExclusiveGateway_2{"X"} --> ExclusiveGateway_1
	Task_9["Campaign period ends"] --> ParallelGateway_2{"+"}
	Task_5 --> ParallelGateway_1{"+"}
	ExclusiveGateway_2 --> Task_2["Sales teams follows up on leads"]
	Task_6 --> ParallelGateway_2
	Task_4 --> ExclusiveGateway_2
	Task_10 --> ParallelGateway_1
	ParallelGateway_1 --> Task_7["Launch campaign"]
	Task_7 --> ParallelGateway_6
	ParallelGateway_2 --> EndEvent_1(("end"))
	ParallelGateway_4 --> Task_9
	ParallelGateway_6 --> Task_3
	StartEvent_1(("start")) --> Task_8
	Task_2 --> ExclusiveGateway_1
	Task_1["Create content"] --> ParallelGateway_1
	ParallelGateway_3 --> Task_1
